import { SetMetadata } from '@nestjs/common';

export const SKIP_AUTH = 'SKIP_AUTH';
export const SkipAuth = () => SetMetadata(SKIP_AUTH, true);
// @SkipAuth() - це наш кастомний декоратор
// використовується над ендпоінтом, де хочемо пропустити авторизацію
// тут ми записуємо в якості метеданих константу ключ SKIP_AUTH зі значенням true
// і передаємо в Guard'у сигнал, що цей маршрут можна автоматично вважати дозволеним,
// бо метадані трушні, відповідно авторизація тоді не потрібна
// SKIP_AUTH — це ключ (константа) для збереження метаданих
